test/artillery/artillery-users-user_id-tasks.yaml
config:
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net"
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Warm up application"
    - duration: 600
      arrivalRate: 50
      name: "Sustained max load"

scenarios:
  - name: "Test flow"
    flow:
      - get:
          url: "/users/1/tasks"
          expect:
            - statusCode: 200