test/artillery/artillery-users-user_id-tasks.yaml
config:
  target: "https://nsc-fun-dev-usw2-thursday.azurewebsites.net/api"
  phases:
    - duration: 300
      arrivalRate: 40
      name: Warm up 1 request per second

scenarios:
  - name: "ramp test"
    flow:
      - get:
          url: "/users/1/tasks"
          expect:
            - statusCode: 200